<template>
  <div class="container">

    <div class="text-4xl font-semibold text-primary mb-8">الأسئلة الشائعة</div>

    <home-qa-card v-for="question in questions" :question class="mb-4" />
  </div>
</template>

<script setup lang="ts">
const questions = ref([
  {
    question: 'لماذا أستخدم منصة سُبُل',
    answer:
      'تهدف منصة سبل إلى تحقيق العديد من المزايا الهامة التي يصعب علينا مناقشتها هنا تهدف منصة سبل إلى تحقيق العديد من المزايا الهامة التي يصعب علينا مناقشتها هنا تهدف منصة سبل إلى تحقيق العديد من المزايا الهامة التي يصعب علينا مناقشتها هنا'
  },
  {
    question: 'لماذا أستخدم منصة سُبُل',
    answer:
      'تهدف منصة سبل إلى تحقيق العديد من المزايا الهامة التي يصعب علينا مناقشتها هنا تهدف منصة سبل إلى تحقيق العديد من المزايا الهامة التي يصعب علينا مناقشتها هنا تهدف منصة سبل إلى تحقيق العديد من المزايا الهامة التي يصعب علينا مناقشتها هنا'
  },
  {
    question: 'لماذا أستخدم منصة سُبُل',
    answer:
      'تهدف منصة سبل إلى تحقيق العديد من المزايا الهامة التي يصعب علينا مناقشتها هنا تهدف منصة سبل إلى تحقيق العديد من المزايا الهامة التي يصعب علينا مناقشتها هنا تهدف منصة سبل إلى تحقيق العديد من المزايا الهامة التي يصعب علينا مناقشتها هنا'
  },
  {
    question: 'لماذا أستخدم منصة سُبُل',
    answer:
      'تهدف منصة سبل إلى تحقيق العديد من المزايا الهامة التي يصعب علينا مناقشتها هنا تهدف منصة سبل إلى تحقيق العديد من المزايا الهامة التي يصعب علينا مناقشتها هنا تهدف منصة سبل إلى تحقيق العديد من المزايا الهامة التي يصعب علينا مناقشتها هنا'
  }
])
</script>
